

. /*  File generated by StatWeave  */
. display "--- Ou" "tput file from StatWeave, engine = StataEngi
> ne ---"
--- Output file from StatWeave, engine = StataEngine ---

. 
. 
. program define SWVrun
  1. //-------
. 
. 
. /* ---- Chunk 1: "stock_watson-1-Stata" ----- */
. display "!-Stat" "Weave-!/swv~line 62~YFGPJ2/out"
  2. set linesize 80
  3. use ..\stata\hmda_sw.dta
  4. gen deny = (s7==3)
  5. gen pi_rat = s46/100
  6. gen black = (s13==3)
  7. display "@-Stat" "Weave-!/swv~line 62~YFGPJ2/out"
  8. 
. /* ---- Chunk 2: "stock_watson-2-Stata" ----- */
. display "!-Stat" "Weave-!/swv~line 72~YFGPJ3/out"
  9. summarize deny if (black==1)
 10. display "@-Stat" "Weave-!/swv~line 72~YFGPJ3/out"
 11. 
. /* ---- Chunk 3: "stock_watson-3-Stata" ----- */
. display "!-Stat" "Weave-!/swv~line 76~YFGPJ4/out"
 12. summarize deny if (black==0)
 13. display "@-Stat" "Weave-!/swv~line 76~YFGPJ4/out"
 14. 
. /* ---- Chunk 4: "stock_watson-4-Stata" ----- */
. display "!-Stat" "Weave-!/swv~line 82~YFGPJ5/out"
 15. gen hse_inc = s45/100
 16. gen loan_val = s6/s50
 17. gen ccred = s43
 18. gen mcred = s42
 19. gen pubrec = (s44>0)
 20. gen denpmi = (s53==1)
 21. gen selfemp = (s27a==1)
 22. gen married = (s23a=="M")
 23. gen single = (married==0)
 24. gen hischl = (school>=12)
 25. gen probunmp = uria
 26. gen condo = (s51 == 1)
 27. sum pi_rat hse_inc loan_val ccred mcred pubrec denpmi selfe
> mp ///
>  single hischl probunmp condo black deny
 28. display "@-Stat" "Weave-!/swv~line 82~YFGPJ5/out"
 29. 
. /* ---- Chunk 5: "stock_watson-5-Stata" ----- */
. display "!-Stat" "Weave-!/swv~line 101~YFGPJ6/out"
 30. gen ltv_med = (loan_val>=0.80)*(loan_val<=.95)
 31. gen ltv_high = (loan_val>0.95) 
 32. gen blk_pi = black*pi_rat
 33. gen blk_hse = black*hse_inc
 34. gen ccred3 = (ccred==3) 
 35. gen ccred4 = (ccred==4)
 36. gen ccred5 = (ccred==5)
 37. gen ccred6 = (ccred==6)
 38. gen mcred3 = (mcred==3)
 39. gen mcred4 = (mcred==4)
 40. display "@-Stat" "Weave-!/swv~line 101~YFGPJ6/out"
 41. 
. /* ---- Chunk 6: "stock_watson-6-Stata" ----- */
. display "!-Stat" "Weave-!/swv~line 118~YFGPJ7/out"
 42. local controls pi_rat hse_inc ltv_med ltv_high ccred mcred 
> ///
>         pubrec denpmi selfemp
 43. regress deny i.black `controls', robust
 44. eststo LPM
 45. display "@-Stat" "Weave-!/swv~line 118~YFGPJ7/out"
 46. 
. /* ---- Chunk 7: "stock_watson-7-Stata" ----- */
. display "!-Stat" "Weave-!/swv~line 127~YFGPJ8/out"
 47. logit deny i.black `controls', r
 48. margins black, atmeans vsquish
 49. quietly estadd margins black, atmeans
 50. mat m = e(margins_b)
 51. quietly estadd scalar prob_white = m[1,1]
 52. quietly estadd scalar prob_black = m[1,2]
 53. quietly estadd scalar prob_diff = m[1,2] - m[1,1]
 54. eststo Logit_2
 55. display "@-Stat" "Weave-!/swv~line 127~YFGPJ8/out"
 56. 
. /* ---- Chunk 8: "stock_watson-8-Stata" ----- */
. display "!-Stat" "Weave-!/swv~line 142~YFGPJ9/out"
 57. quietly probit deny i.black `controls', r
 58. quietly estadd margins black, atmeans
 59. mat m = e(margins_b)
 60. quietly estadd scalar prob_white = m[1,1]
 61. quietly estadd scalar prob_black = m[1,2]
 62. quietly estadd scalar prob_diff = m[1,2] - m[1,1]
 63. eststo Probit_3
 64. display "@-Stat" "Weave-!/swv~line 142~YFGPJ9/out"
 65. 
. /* ---- Chunk 9: "stock_watson-9-Stata" ----- */
. display "!-Stat" "Weave-!/swv~line 154~YFGPJ10/out"
 66. quietly probit deny i.black `controls' single hischl probun
> mp, r
 67. quietly estadd margins black, atmeans
 68. mat m = e(margins_b)
 69. quietly estadd scalar prob_white = m[1,1]
 70. quietly estadd scalar prob_black = m[1,2]
 71. quietly estadd scalar prob_diff = m[1,2] - m[1,1]
 72. eststo Probit_4
 73. 
. quietly probit deny i.black `controls' single hischl probunmp 
> ///
>  mcred3 mcred4 ccred3 ccred4 ccred5 ccred6 condo, r
 74. quietly estadd margins black, atmeans
 75. mat m = e(margins_b)
 76. quietly estadd scalar prob_white = m[1,1]
 77. quietly estadd scalar prob_black = m[1,2]
 78. quietly estadd scalar prob_diff = m[1,2] - m[1,1]
 79. eststo Probit_5
 80. 
. quietly probit deny i.black `controls' ///
>  single hischl probunmp i.black#c.pi_rat i.black#c.hse_inc
 81. quietly estadd margins black, atmeans
 82. mat m = e(margins_b)
 83. quietly estadd scalar prob_white = m[1,1]
 84. quietly estadd scalar prob_black = m[1,2]
 85. quietly estadd scalar prob_diff = m[1,2] - m[1,1]
 86. eststo Probit_inter
 87. display "@-Stat" "Weave-!/swv~line 154~YFGPJ10/out"
 88. 
. /* ---- Chunk 10: "stock_watson-10-Stata" ----- */
. display "!-Stat" "Weave-!/swv~line 184~YFGPJ11/out"
 89. set linesize 120
 90. esttab LPM Logit_2 Probit_3 Probit_4 Probit_5 Probit_inter,
>  ///
>         stats(prob_white prob_black prob_diff)  mtitle replace
 91. display "@-Stat" "Weave-!/swv~line 184~YFGPJ11/out"
 92. 
. /* ---- Chunk 11: "stock_watson-11-Stata" ----- */
. display "!-Stat" "Weave-!/swv~line 191~YFGPJ12/out"
 93. quietly logit deny i.black `controls', r
 94. quietly margins black, atmeans
 95. quietly marginsplot
 96. display "@-Stat" "Weave-!/swv~line 191~YFGPJ12/out"
 97. graph display, xsize(6.0) ysize(4.0)
 98. graph export stock_watson-11-Stata-fig.eps,  replace
 99. 
. //--------------
. end

. 
. SWVrun
!-StatWeave-!/swv~line 62~YFGPJ2/out
@-StatWeave-!/swv~line 62~YFGPJ2/out
!-StatWeave-!/swv~line 72~YFGPJ3/out

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        deny |       339    .2831858    .4512119          0          1
@-StatWeave-!/swv~line 72~YFGPJ3/out
!-StatWeave-!/swv~line 76~YFGPJ4/out

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        deny |      2041    .0926017    .2899445          0          1
@-StatWeave-!/swv~line 76~YFGPJ4/out
!-StatWeave-!/swv~line 82~YFGPJ5/out

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
      pi_rat |      2380    .3308136    .1072573          0          3
     hse_inc |      2380    .2553461    .0966556          0          3
    loan_val |      2380    .7377759     .178751        .02       1.95
       ccred |      2380    2.116387    1.666721          1          6
       mcred |      2380    1.721008    .5372816          1          4
-------------+--------------------------------------------------------
      pubrec |      2380    .0735294    .2610584          0          1
      denpmi |      2380    .0201681    .1406045          0          1
     selfemp |      2380    .1163866    .3207553          0          1
      single |      2380    .3932773    .4885802          0          1
      hischl |      2380    .9836134    .1269835          0          1
-------------+--------------------------------------------------------
    probunmp |      2380    3.774496    2.027062        1.8       10.6
       condo |      2380    .2882353    .4530364          0          1
       black |      2380     .142437    .3495712          0          1
        deny |      2380    .1197479    .3247347          0          1
@-StatWeave-!/swv~line 82~YFGPJ5/out
!-StatWeave-!/swv~line 101~YFGPJ6/out
@-StatWeave-!/swv~line 101~YFGPJ6/out
!-StatWeave-!/swv~line 118~YFGPJ7/out

Linear regression                                      Number of obs =    2380
                                                       F( 10,  2369) =   67.22
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2663
                                                       Root MSE      =  .27875

------------------------------------------------------------------------------
             |               Robust
        deny |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     1.black |   .0836967   .0225623     3.71   0.000     .0394529    .1279406
      pi_rat |   .4487963   .1135962     3.95   0.000     .2260381    .6715545
     hse_inc |  -.0480226    .109559    -0.44   0.661     -.262864    .1668187
     ltv_med |   .0314498   .0127391     2.47   0.014     .0064688    .0564308
    ltv_high |   .1890511   .0501681     3.77   0.000     .0906732     .287429
       ccred |   .0307716   .0045843     6.71   0.000     .0217819    .0397612
       mcred |   .0209104   .0112898     1.85   0.064    -.0012284    .0430493
      pubrec |   .1970876   .0348812     5.65   0.000     .1286867    .2654885
      denpmi |   .7018841   .0451051    15.56   0.000     .6134345    .7903337
     selfemp |   .0598438   .0205233     2.92   0.004     .0195983    .1000894
       _cons |  -.1829933   .0276729    -6.61   0.000    -.2372589   -.1287277
------------------------------------------------------------------------------
@-StatWeave-!/swv~line 118~YFGPJ7/out
!-StatWeave-!/swv~line 127~YFGPJ8/out

Iteration 0:   log pseudolikelihood =  -872.0853  
Iteration 1:   log pseudolikelihood = -672.05096  
Iteration 2:   log pseudolikelihood = -656.94676  
Iteration 3:   log pseudolikelihood = -636.05789  
Iteration 4:   log pseudolikelihood = -635.63857  
Iteration 5:   log pseudolikelihood = -635.63667  
Iteration 6:   log pseudolikelihood = -635.63667  

Logistic regression                               Number of obs   =       2380
                                                  Wald chi2(10)   =     265.96
                                                  Prob > chi2     =     0.0000
Log pseudolikelihood = -635.63667                 Pseudo R2       =     0.2711

------------------------------------------------------------------------------
             |               Robust
        deny |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     1.black |   .6884231   .1821237     3.78   0.000     .3314673    1.045379
      pi_rat |   4.764416   1.329396     3.58   0.000     2.158848    7.369985
     hse_inc |  -.1088114   1.294986    -0.08   0.933    -2.646938    2.429315
     ltv_med |    .463525   .1600764     2.90   0.004      .149781     .777269
    ltv_high |   1.494764   .3242173     4.61   0.000     .8593095    2.130218
       ccred |   .2903017   .0388286     7.48   0.000     .2141991    .3664043
       mcred |   .2790178   .1376277     2.03   0.043     .0092724    .5487631
      pubrec |   1.225797   .2030504     6.04   0.000     .8278253    1.623768
      denpmi |   4.548166   .5744167     7.92   0.000      3.42233    5.674002
     selfemp |   .6661288   .2133542     3.12   0.002     .2479623    1.084295
       _cons |  -5.707384   .4834338   -11.81   0.000    -6.654896   -4.759871
------------------------------------------------------------------------------

Adjusted predictions                              Number of obs   =       2380
Model VCE    : Robust

Expression   : Pr(deny), predict()
at           : 0.black         =     .857563 (mean)
               1.black         =     .142437 (mean)
               pi_rat          =    .3308136 (mean)
               hse_inc         =    .2553461 (mean)
               ltv_med         =    .3743697 (mean)
               ltv_high        =    .0323529 (mean)
               ccred           =    2.116387 (mean)
               mcred           =    1.721008 (mean)
               pubrec          =    .0735294 (mean)
               denpmi          =    .0201681 (mean)
               selfemp         =    .1163866 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       black |
          0  |   .0702292   .0061475    11.42   0.000     .0581803    .0822781
          1  |   .1307037   .0200064     6.53   0.000     .0914919    .1699156
------------------------------------------------------------------------------
@-StatWeave-!/swv~line 127~YFGPJ8/out
!-StatWeave-!/swv~line 142~YFGPJ9/out
@-StatWeave-!/swv~line 142~YFGPJ9/out
!-StatWeave-!/swv~line 154~YFGPJ10/out
@-StatWeave-!/swv~line 154~YFGPJ10/out
!-StatWeave-!/swv~line 184~YFGPJ11/out

------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)   
                      LPM         Logit_2        Probit_3        Probit_4        Probit_5    Probit_inter   
------------------------------------------------------------------------------------------------------------
main                                                                                                        
0.black                 0               0               0               0               0               0   
                      (.)             (.)             (.)             (.)             (.)             (.)   

1.black            0.0837***        0.688***        0.389***        0.371***        0.363***        0.246   
                   (3.71)          (3.78)          (3.98)          (3.76)          (3.64)          (0.63)   

pi_rat              0.449***        4.764***        2.442***        2.464***        2.622***        2.572***
                   (3.95)          (3.58)          (4.01)          (4.11)          (4.30)          (4.39)   

hse_inc           -0.0480          -0.109          -0.185          -0.302          -0.502          -0.538   
                  (-0.44)         (-0.08)         (-0.27)         (-0.45)         (-0.72)         (-0.74)   

ltv_med            0.0314*          0.464**         0.214**         0.216**         0.215**         0.216** 
                   (2.47)          (2.90)          (2.62)          (2.63)          (2.58)          (2.61)   

ltv_high            0.189***        1.495***        0.791***        0.795***        0.836***        0.788***
                   (3.77)          (4.61)          (4.40)          (4.39)          (4.59)          (4.47)   

ccred              0.0308***        0.290***        0.155***        0.158***        0.344**         0.158***
                   (6.71)          (7.48)          (7.36)          (7.47)          (3.25)          (7.28)   

mcred              0.0209           0.279*          0.148*          0.110           0.162           0.111   
                   (1.85)          (2.03)          (2.03)          (1.46)          (1.59)          (1.48)   

pubrec              0.197***        1.226***        0.697***        0.702***        0.717***        0.705***
                   (5.65)          (6.04)          (6.05)          (6.05)          (6.13)          (5.88)   

denpmi              0.702***        4.548***        2.557***        2.585***        2.589***        2.590***
                  (15.56)          (7.92)          (8.57)          (8.80)          (8.68)          (9.06)   

selfemp            0.0598**         0.666**         0.359**         0.346**         0.342**         0.348** 
                   (2.92)          (3.12)          (3.18)          (3.02)          (2.97)          (3.07)   

single                                                              0.229**         0.230**         0.226** 
                                                                   (2.87)          (2.71)          (2.81)   

hischl                                                             -0.613**        -0.604*         -0.620** 
                                                                  (-2.65)         (-2.55)         (-2.59)   

probunmp                                                           0.0300          0.0280          0.0297   
                                                                   (1.66)          (1.57)          (1.64)   

mcred3                                                                             -0.107                   
                                                                                  (-0.37)                   

mcred4                                                                             -0.383                   
                                                                                  (-0.90)                   

ccred3                                                                             -0.226                   
                                                                                  (-0.94)                   

ccred4                                                                             -0.251                   
                                                                                  (-0.75)                   

ccred5                                                                             -0.789                   
                                                                                  (-1.94)                   

ccred6                                                                             -0.905                   
                                                                                  (-1.78)                   

condo                                                                             -0.0550                   
                                                                                  (-0.59)                   

0.black#c.~t                                                                                            0   
                                                                                                      (.)   

1.black#c.~t                                                                                       -0.579   
                                                                                                  (-0.42)   

0.black#c.~c                                                                                            0   
                                                                                                      (.)   

1.black#c.~c                                                                                        1.232   
                                                                                                   (0.74)   

_cons              -0.183***       -5.707***       -3.041***       -2.575***       -2.896***       -2.543***
                  (-6.61)        (-11.81)        (-13.22)         (-7.68)         (-7.47)         (-7.76)   
------------------------------------------------------------------------------------------------------------
prob_white                         0.0702          0.0738          0.0719          0.0704          0.0719   
prob_black                          0.131           0.145           0.138           0.134           0.137   
prob_diff                          0.0605          0.0710          0.0658          0.0631          0.0654   
------------------------------------------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001
@-StatWeave-!/swv~line 184~YFGPJ11/out
!-StatWeave-!/swv~line 191~YFGPJ12/out
@-StatWeave-!/swv~line 191~YFGPJ12/out
(file stock_watson-11-Stata-fig.eps written in EPS format)

. log using stata_check.smcl
------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\j.heemann-minx\Documents\GitHub\panel_methods_slides\sw\tex\stata_check.smcl
  log type:  smcl
 opened on:  25 Nov 2015, 17:27:33

. 
. 
end of do-file
