--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\m.callaghan\Documents\GitHub\panel_methods_slides\assignme
> nt\stata\stern_assignment_q2.log
  log type:  text
 opened on:   4 Nov 2015, 20:12:09

. *@*lstart
. /*load the data (delimiters can be either tab or space or a combination,
> collapse tells stata to treat a combination of delimiters as one delimiter 
> */
. import delimited ../data/stern2.dat, delimiters("\t ",collapse)
(8 vars, 2294 obs)

. 
. * uncomment to remove kuwait 
. * drop if country==98
. 
. *set up panel
. xtset country year
       panel variable:  country (strongly balanced)
        time variable:  year, 1960 to 1990
                delta:  1 unit

. 
. xtdescribe 

 country:  1, 14, ..., 147                                   n =         74
    year:  1960, 1961, ..., 1990                             T =         31
           Delta(year) = 1 unit
           Span(year)  = 31 periods
           (country*year uniquely identifies each observation)

Distribution of T_i:   min      5%     25%       50%       75%     95%     max
                        31      31      31        31        31      31      31

     Freq.  Percent    Cum. |  Pattern
 ---------------------------+---------------------------------
       74    100.00  100.00 |  1111111111111111111111111111111
 ---------------------------+---------------------------------
       74    100.00         |  XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX

. xtsum sopc gdpppp

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
sopc     overall |  .0215023   .0366821   8.90e-07   .4655517 |     N =    2294
         between |             .0337633   .0000997   .2302244 |     n =      74
         within  |             .0148502  -.0996998   .2568297 |     T =      31
                 |                                            |
gdpppp   overall |  5359.908   6244.168        303   80830.76 |     N =    2294
         between |             5443.544   449.3548    38849.2 |     n =      74
         within  |             3121.721  -27160.64   47341.46 |     T =      31

. 
. *histogram gdp and sopc (do we need to transform them
. hist gdpppp, normal kdensity
(bin=33, start=303, width=2440.2351)

. graph export hist_gdp.png, replace
(file hist_gdp.png written in PNG format)

. hist sopc, normal kdensity
(bin=33, start=8.900e-07, width=.0141076)

. graph export hist_sopc.png, replace
(file hist_sopc.png written in PNG format)

. 
. 
. *create new transformed variables and squared term
. cap gen lgdp = log(gdpppp)

. cap gen lsopc = log(sopc)

. *@*lend
. log close
      name:  <unnamed>
       log:  C:\Users\m.callaghan\Documents\GitHub\panel_methods_slides\assignme
> nt\stata\stern_assignment_q2.log
  log type:  text
 closed on:   4 Nov 2015, 20:12:10
--------------------------------------------------------------------------------
