--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\m.callaghan\Documents\GitHub\panel_methods_slides\assignme
> nt\stata\stern_assignment_q9.log
  log type:  text
 opened on:   4 Nov 2015, 20:10:23

. *@*lstart
. 
. eststo ran_world: quietly xtreg lsopc lgdp lgdpsq, re

. estadd scalar e_tp = exp(-_b[lgdp]/(2*_b[lgdpsq]))

added scalar:
               e(e_tp) =  46078.823

. 
. eststo ran_oecd: quietly xtreg lsopc lgdp lgdpsq if oe==1000, re

. estadd scalar e_tp = exp(-_b[lgdp]/(2*_b[lgdpsq]))

added scalar:
               e(e_tp) =  9160.52

. 
. eststo ran_non_oecd: quietly xtreg lsopc lgdp lgdpsq if oe==2000, re

. estadd scalar e_tp = exp(-_b[lgdp]/(2*_b[lgdpsq]))

added scalar:
               e(e_tp) =  300636.6

. 
. 
. esttab ran_world ran_oecd ran_non_oecd, stats(e_tp)

------------------------------------------------------------
                      (1)             (2)             (3)   
                    lsopc           lsopc           lsopc   
------------------------------------------------------------
lgdp                3.266***        12.22***        2.399***
                   (9.34)         (16.77)          (5.50)   

lgdpsq             -0.152***       -0.670***      -0.0951***
                  (-7.20)        (-16.28)         (-3.54)   

_cons              -21.38***       -59.59***       -18.26***
                 (-14.71)        (-18.47)        (-10.27)   
------------------------------------------------------------
e_tp              46078.8          9160.5        300636.6   
------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. *@*lend
. log close
      name:  <unnamed>
       log:  C:\Users\m.callaghan\Documents\GitHub\panel_methods_slides\assignme
> nt\stata\stern_assignment_q9.log
  log type:  text
 closed on:   4 Nov 2015, 20:10:24
--------------------------------------------------------------------------------
