-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\j.heemann-minx\Documents\GitHub\panel_methods_slides\sw\stata\logs\7_probit.log
  log type:  text
 opened on:  23 Nov 2015, 20:30:11

. *@*lstart;
.  ** col(3) - Probit with robust standard errors;
. probit deny i.black `controls', r;

Iteration 0:   log pseudolikelihood =  -872.0853  
Iteration 1:   log pseudolikelihood = -643.92086  
Iteration 2:   log pseudolikelihood = -636.87532  
Iteration 3:   log pseudolikelihood = -636.84706  
Iteration 4:   log pseudolikelihood = -636.84706  

Probit regression                                 Number of obs   =       2380
                                                  Wald chi2(10)   =     293.99
                                                  Prob > chi2     =     0.0000
Log pseudolikelihood = -636.84706                 Pseudo R2       =     0.2697

------------------------------------------------------------------------------
             |               Robust
        deny |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     1.black |   .3891261   .0977879     3.98   0.000     .1974653    .5807869
      pi_rat |   2.441787   .6092459     4.01   0.000     1.247687    3.635887
     hse_inc |  -.1846764   .6753349    -0.27   0.785    -1.508308    1.138956
     ltv_med |   .2139677   .0815119     2.62   0.009     .0542073    .3737281
    ltv_high |   .7910831   .1797445     4.40   0.000     .4387903    1.143376
       ccred |   .1546224   .0209979     7.36   0.000     .1134672    .1957776
       mcred |   .1477082    .072594     2.03   0.042     .0054266    .2899899
      pubrec |   .6974496   .1153109     6.05   0.000     .4714445    .9234548
      denpmi |   2.556796   .2983301     8.57   0.000      1.97208    3.141512
     selfemp |   .3586252   .1126041     3.18   0.001     .1379252    .5793252
       _cons |  -3.040568   .2300051   -13.22   0.000     -3.49137   -2.589766
------------------------------------------------------------------------------

. quietly estadd margins black, atmeans;

. mat m = e(margins_b);

. estadd scalar prob_white = m[1,1];

added scalar:
         e(prob_white) =  .07377839

. estadd scalar prob_black = m[1,2];

added scalar:
         e(prob_black) =  .14477953

. estadd scalar prob_diff = m[1,2] - m[1,1];

added scalar:
          e(prob_diff) =  .07100114

. eststo Probit_3;

. margins black, atmeans;

Adjusted predictions                              Number of obs   =       2380
Model VCE    : Robust

Expression   : Pr(deny), predict()
at           : 0.black         =     .857563 (mean)
               1.black         =     .142437 (mean)
               pi_rat          =    .3308136 (mean)
               hse_inc         =    .2553461 (mean)
               ltv_med         =    .3743697 (mean)
               ltv_high        =    .0323529 (mean)
               ccred           =    2.116387 (mean)
               mcred           =    1.721008 (mean)
               pubrec          =    .0735294 (mean)
               denpmi          =    .0201681 (mean)
               selfemp         =    .1163866 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       black |
          0  |   .0737784   .0063951    11.54   0.000     .0612442    .0863126
          1  |   .1447795   .0209432     6.91   0.000     .1037316    .1858274
------------------------------------------------------------------------------

. *@*lend;
. cap log close;
