-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\j.heemann-minx\Documents\GitHub\panel_methods_slides\sw\stata\logs\8_controls.log
  log type:  text
 opened on:  23 Nov 2015, 20:30:11

. *@*lstart;
.  ** col(4) - Probit with more controls;
. probit deny i.black `controls' single hischl probunmp, r;

Iteration 0:   log pseudolikelihood =  -872.0853  
Iteration 1:   log pseudolikelihood = -636.63836  
Iteration 2:   log pseudolikelihood =  -628.6448  
Iteration 3:   log pseudolikelihood = -628.61368  
Iteration 4:   log pseudolikelihood = -628.61368  

Probit regression                                 Number of obs   =       2380
                                                  Wald chi2(13)   =     311.96
                                                  Prob > chi2     =     0.0000
Log pseudolikelihood = -628.61368                 Pseudo R2       =     0.2792

------------------------------------------------------------------------------
             |               Robust
        deny |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     1.black |   .3710683   .0987537     3.76   0.000     .1775146     .564622
      pi_rat |   2.464318   .5992224     4.11   0.000     1.289864    3.638772
     hse_inc |  -.3024734   .6753734    -0.45   0.654    -1.626181    1.021234
     ltv_med |   .2157285   .0818919     2.63   0.008     .0552234    .3762336
    ltv_high |   .7945421   .1808344     4.39   0.000     .4401132    1.148971
       ccred |   .1575922   .0210859     7.47   0.000     .1162647    .1989198
       mcred |   .1104117   .0757864     1.46   0.145     -.038127    .2589504
      pubrec |   .7021586   .1160344     6.05   0.000     .4747354    .9295818
      denpmi |   2.585178   .2937658     8.80   0.000     2.009408    3.160949
     selfemp |   .3459452   .1147379     3.02   0.003      .121063    .5708273
      single |   .2294801   .0798497     2.87   0.004     .0729776    .3859826
      hischl |   -.612624   .2312135    -2.65   0.008    -1.065794    -.159454
    probunmp |   .0300305   .0181281     1.66   0.098       -.0055     .065561
       _cons |  -2.574574   .3352743    -7.68   0.000    -3.231699   -1.917448
------------------------------------------------------------------------------

. quietly estadd margins black, atmeans;

. mat m = e(margins_b);

. estadd scalar prob_white = m[1,1];

added scalar:
         e(prob_white) =  .07193624

. estadd scalar prob_black = m[1,2];

added scalar:
         e(prob_black) =  .13775686

. estadd scalar prob_diff = m[1,2] - m[1,1];

added scalar:
          e(prob_diff) =  .06582062

. eststo Probit_4;

. test single hischl probunmp;

 ( 1)  [deny]single = 0
 ( 2)  [deny]hischl = 0
 ( 3)  [deny]probunmp = 0

           chi2(  3) =   17.54
         Prob > chi2 =    0.0005

. *@*lend;
. cap log close;
